OdDAI.ApplicationInstance.getDynamicAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves inverse or derived attribute value by its name.
\param attrName [in] A null-terminated ANSI string that contains the attribute name.
\returns The value of the attribute represented with an OdRxValue object.

OdDAI.ApplicationInstance.getDerivedAttr(OdDAI.DerivedAttribute*)
\details
Evaluates an expression to retrieve derived attribute value.
\param derivedAttribute [in] A raw pointer to the derived attribute instance to be returned.
\returns The value of the attribute represented with an OdRxValue object.

OdDAI.ApplicationInstance.subSetAttributes(OdGiDrawableTraits*)
\details
Sets the values of the entity's sub-entity traits.
\param traits [out] A raw pointer to the traits to be filled and returned to a calling subroutine.
\returns The result of setting the values.

OdDAI.ApplicationInstance.gsNode
\details
Retrieves the current Gs node object of the entity.
\returns A raw pointer to the OdGsCache object associated with the entity.

OdDAI.ApplicationInstance.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the entity.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdDAI.ApplicationInstance.subWorldDraw(OdGiWorldDraw*)
\details
Draws a graphical entity representation that is independent of any viewport context.
\param wd [in] A raw pointer to the object that encapsulates parameters of viewport-independent vectorization.
\returns true if the drawing was successful; otherwise, the method returns false.

OdDAI.ApplicationInstance.findUsedInBN(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of all the entity instances in the model which refer to the entity instance through the specified attribute name.
\param roleName   [in] An ANSI string that contains a fully qualified attribute name,
for example, "ifcplacement.location".
\param resultList [in/out] A raw pointer to a non-persistent list that contains identifiers of entity instances which have any attribute
that refers to the current entity instance through a specified attribute name.
\returns A raw pointer to a non-persistent list that contains identifiers of entity instances which have any attribute that refers to the current entity instance through a specified attribute name.

OdDAI.ApplicationInstance.findUsers(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of all the entity instances in the model that refer to the current entity instance.
\param resultList [in/out] A raw pointer to a non-persistent list that contains identifiers of entity instances which have any attribute that refers to the current entity instance.
\returns A raw pointer to a non-persistent list that contains identifiers of entity instances which have any attribute that refers to the current entity instance.

OdDAI.ApplicationInstance.findRolesOf(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the identifiers of the attributes of entity instances which refer to the current entity instance within the model.
\param resultList [in/out] A raw pointer to a non-persistent list that contains identifiers of attributes which refer to the current entity instance.
\returns A raw pointer to a non-persistent list that contains identifiers of attributes which refer to the current entity instance.

OdDAI.ApplicationInstance.findDataTypes(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Retrieves the Named/Defined data types of the entity instance according to the schema types hierarchy.
\param resultList [in/out] A raw pointer to a non-persistent list that contains identifiers of entity instance data types.
\returns A raw pointer to a non-persistent list that contains identifiers of Named/Defined data types of the entity instance.

OdDAI.ApplicationInstance.getDerivedAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Calculates a value of a derived attribute specified by its name.
\param attrName [in] An ANSI string that contains the derived attribute name.
\returns The calculated value of the attribute.
\remarks
The method provides the late binding access to the derived attribute value
by its name.

OdDAI.ApplicationInstance.validateWhereRule(OdDAI.WhereRule!System.Runtime.CompilerServices.IsConst*)
\details
Checks the constraint (Where-Rule) for the application instance. The constraint (Where-Rule) is defined within the application entity definition or within a parent application entity definition.
\param ruleDef [in] A raw pointer to the constraint (Where-Rule) object.
\returns
* true if the constraint is satisfied.
* false if the constraint is violated.
* unknown if the constraint is not defined or can not be evaluated for any reason (an EXPRESS error, incorrectly filled data, mandatory data is unset, etc.).

OdDAI.ApplicationInstance.validateWhereRule(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Checks the constraint (Where-Rule) for the application instance. The constraint (Where-Rule) is defined within the application entity definition or within a parent application entity definition.
\param ruleName [in] A null-terminated string that contains the name of the constraint (Where-Rule) to be validated.
\returns
* true if the constraint is satisfied.
* false if the constraint is violated.
* unknown if the constraint is not defined or can not be evaluated for any reason (an EXPRESS error, incorrectly filled data, mandatory data is unset, etc.).

OdDAI.ApplicationInstance.copyFrom(OdRxObject!System.Runtime.CompilerServices.IsConst*)
details
Copies the contents of the specified object into this object.
\param pSource [in] A raw pointer to the source object.
\remarks
The default implementation of this function does nothing but throws the eNotApplicable exception.

OdDAI.ApplicationInstance.comparedToInverse(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Compares the application instance object with another object by comparing their inverse attributes.
\param pOther [in]  A raw pointer to the object to be compared.
\returns An OdRx::Ordering value that represents the result of the comparison operation.
\remarks
This method returns one of the following:
NameValueDescription_kLessThan_-1This object is less than Other Object._kEqual_0This object equals Other Object._kGreaterThan_1This object is greater than Other Object._kNotOrderable_2This class is not orderable.

OdDAI.ApplicationInstance.comparedTo(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Compares the application instance object with another object.
\param pOther [in]  A raw pointer to the object to be compared.
\returns An OdRx::Ordering value that represents the result of the comparison operation.
\remarks
The method returns one of the following:
NameValueDescription_kLessThan_-1This object is less than Other Object._kEqual_0This object equals Other Object._kGreaterThan_1This object is greater than Other Object._kNotOrderable_2This class is not orderable.
The default implementation of this method returns _kNotOrderable_.
\sa
* Comparing the Value of Rx Objects.
* Comparing Rx-Objects

OdDAI.ApplicationInstance.id
\details
Retrieves the database object identifier of the application instance.
\returns The application instance's database identifier represented with a raw pointer to an OdDbStub object.
\remarks
The method returns a NULL pointer if the application instance is not persistent (i.e. not stored in a database).

OdDAI.ApplicationInstance.getAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value of an attribute.
\param attDef [in] A smart pointer to attribute definition.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its definition.

OdDAI.ApplicationInstance.typeName
\details
Retrieves the type name of the application instance.
\returns An ANSI string that contains the type name.

OdDAI.ApplicationInstance.cleanDynamicAttributes
\details
Cleans dynamic attributes.

OdDAI.ApplicationInstance.getInverseAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an inverse attribute with a specified name.
\param attrName [in] A null-terminated string that contains the inverse attribute's name.
\returns
An OdRxValue object that contains the inverse attribute value.

OdDAI.ApplicationInstance.resetInverseCounterParts
\details
Removes inverse attributes from related application instances.

OdDAI.ApplicationInstance.setInverseCounterParts
\details
Sets inverse attributes to related application instances.

OdDAI.ApplicationInstance.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the application instance belongs to or is derived from a certain entity type with a specified name.
\param entityName [in] A name of entities type.
\returns true if the application instance belongs to or is derived from the type of entity with the specified name; otherwise, the method returns false.

OdDAI.ApplicationInstance.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the application instance is an instance of an instance type with a specified name.
\param entityName [in] An entity's type name.
\returns true if the application instance is an instance of the specified type; otherwise, the method returns false.

OdDAI.ApplicationInstance.outFields(OdDAI.OdSpfFilerBase*)
\details
Writes values of the instance's explicit attribute fields to a file buffer that is assigned to a specified filer object.
\param wrFiler [in] A raw pointer to the filer object assigned with the file buffer to write data to.
\returns eOk if the attribute field values are successfully written; otherwise, the method returns an appropriate error.
\remarks
The method's default implementation returns the eNotImplemented value.

OdDAI.ApplicationInstance.inFields(OdDAI.OdSpfFilerBase*)
\details
Reads values of the instance's explicit attribute fields from a file buffer that is associated with a specified filer object.
\param rdFiler [in] A raw pointer to the filer object associated with the file buffer to read data from.
\returns eOk if the attribute field values are successfully read; otherwise, the method returns an appropriate error.
\remarks
The method's default implementation returns the eNotImplemented value.

OdDAI.ApplicationInstance.owningStepFile
\details
Retrieves the file that contains the model with this application instance.
\returns A raw pointer to the owning file; if the application instance is not appended to any model or file, the method returns a NULL pointer.

OdDAI.ApplicationInstance.owningModel
\details
Retrieves the model that contains the application instance.
\returns A raw pointer to the owning model; if the application instance is not appended to any model, the method returns a NULL pointer.

OdDAI.ApplicationInstance.#ctor
\details
Creates a new application instance with default parameters.

OdDAI.ApplicationInstance
\details
The base class for application instances that can be manipulated with the Data Access Interface (DAI).